---
kind: type
id: T:Autodesk.Revit.DB.MEPSystem
zh: 系统
source: html/65946955-8638-fafb-2657-ef7cb7b2941b.htm
---
# Autodesk.Revit.DB.MEPSystem

**中文**: 系统

A system in the Autodesk Revit MEP product.

## Syntax (C#)
```csharp
public class MEPSystem : Element
```

## Remarks
This is the base class for electrical, mechanical and piping systems,
 available only in the Autodesk Revit MEP product.